In [4]:
import pandas as pd
import numpy as np

#### Q1. List any five functions of the pandas library with execution.

In [5]:
# Dataframe creation 
print("""Any five or most common funtions of pandas are: 
a) dtypes
b) info()
c) describe()
d) isnull()
e) duplicated()""")
df = pd.DataFrame({'A': range(1,11), 'B': range(11,21)})

Any five or most common funtions of pandas are:
a) dtypes
b) info()
c) describe()
d) isnull()
e) duplicated()

In [6]:
# a) dtypes
df['A'].dtypes

dtype('int64')

In [7]:
# b) info()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       10 non-null     int64
 1   B       10 non-null     int64
dtypes: int64(2)
memory usage: 288.0 bytes

In [8]:
# c) describe()
df.describe()

              A         B
count  10.00000  10.00000
mean    5.50000  15.50000
std     3.02765   3.02765
min     1.00000  11.00000
25%     3.25000  13.25000
50%     5.50000  15.50000
75%     7.75000  17.75000
max    10.00000  20.00000

In [9]:
# d) isnull()
df.isnull()

       A      B
0  False  False
1  False  False
2  False  False
3  False  False
4  False  False
5  False  False
6  False  False
7  False  False
8  False  False
9  False  False

In [10]:
# e) duplicated()
df['A'].duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
Name: A, dtype: bool


#### Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [11]:
df['C'] = range(21, 31)

#### Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.

For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [12]:
# Creating dataframe

df1 = pd.DataFrame(data = [10,20,30,40,50], columns= ['Values'])

In [13]:
# Creating function named values_sum that calculates sum of first 3 numbers in a list.

def values_sum(n):
    k = 0
    for i in n.index:
        if i< 3:
            k+=n['Values'][i]
    return k

In [14]:
print(f" The sum of first 3 values of Values column in df1 dataframe is: {values_sum(df1)}")

 The sum of first 3 values of Values column in df1 dataframe is: 60

#### Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [15]:
df3 = pd.DataFrame(data = {'Text': ['mango', 'apple', 'avocado', 'grapes', 'banana', 'kiwi']})

In [16]:
def word_count(n):
    count_lst = []
    for i in df3.index:
        count_lst.append(len(df3['Text'][i]))
    n['Word_Count'] = count_lst

In [17]:
word_count(df3)

In [18]:
df3

      Text  Word_Count
0    mango           5
1    apple           5
2  avocado           7
3   grapes           6
4   banana           6
5     kiwi           4

#### Q5. How are DataFrame.size() and DataFrame.shape() different?

Ans: Size in dataframe returns numbers of element in a dataframe whereas shape in dataframe returns the dimensions of dataframe i.e 1-D and 2-D (row, columns).

In [19]:
print(f"Size of Dataframe is: ", df.size)
print(f"Shape of Dataframe is: ", df.shape)

Size of Dataframe is:  30
Shape of Dataframe is:  (10, 3)

#### Q6. Which function of pandas do we use to read an excel file?

Ans: We use pd.read_excel() in pandas to read a excel file.

#### Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [28]:
df5 = pd.DataFrame(data = {'Email': ['mango@gmail.com', 'apple@yahoo.com', 'kiwi@outlook.com', 'banana@minions.com']})
df5

                Email
0     mango@gmail.com
1     apple@yahoo.com
2    kiwi@outlook.com
3  banana@minions.com

In [33]:
def email_name(n):
    username = []
    for i in n.index:
        username.append(n['Email'][i].split('@')[0])
    n['Username'] = username
    return n

In [34]:
email_name(df5)

                Email Username
0     mango@gmail.com    mango
1     apple@yahoo.com    apple
2    kiwi@outlook.com     kiwi
3  banana@minions.com   banana

#### Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

For example, if df contains the following values:

  A   B   C

0  3   5   1

1  8   2   7

2  6   9   4

3  2   3   5

4  9   1   2

Your function should select the following rows:   

A   B   C

1  8   2   7

4  9   1   2

The function should return a new DataFrame that contains only the selected rows

Ans: Question and related example is ambiguous. I will use example as a base in solving this question.

In [100]:
df4 = pd.DataFrame(data = {'A': [3,8,6,2,9] ,'B': [5,2,9,3,1],'C': [1,7,4,5,2]})
df4

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [119]:
def selected_rows(n):
    return n.loc[(n.index == 1) | (n.index == 4)]

In [120]:
selected_rows(df4)

   A  B  C
1  8  2  7
4  9  1  2

#### Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [121]:
df1

   Values
0      10
1      20
2      30
3      40
4      50

In [122]:
def central_tendencies(n):
    return f"mean: {np.mean(n)}, median:{np.median(n)}, standard deviation:{np.std(n)}"

In [123]:
central_tendencies(df1)

'mean: 30.0, median:30.0, standard deviation:Values    14.142136\ndtype: float64'

#### Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [124]:
sales = pd.Series(np.random.randint(1, 10, size = 10))
date = pd.date_range(start = '2023-05-01', end = '2023-05-10')

In [125]:
df2 = pd.DataFrame(data = {'sales': sales, 'date': date})

In [126]:
df2

   sales       date
0      6 2023-05-01
1      5 2023-05-02
2      9 2023-05-03
3      5 2023-05-04
4      4 2023-05-05
5      2 2023-05-06
6      7 2023-05-07
7      3 2023-05-08
8      7 2023-05-09
9      9 2023-05-10

In [127]:
df2["sales_moving_avg"] = df2['sales'].rolling(window=7, min_periods= 1).mean()
df2

   sales       date  sales_moving_avg
0      6 2023-05-01          6.000000
1      5 2023-05-02          5.500000
2      9 2023-05-03          6.666667
3      5 2023-05-04          6.250000
4      4 2023-05-05          5.800000
5      2 2023-05-06          5.166667
6      7 2023-05-07          5.428571
7      3 2023-05-08          5.000000
8      7 2023-05-09          5.285714
9      9 2023-05-10          5.285714

#### Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.

For example, if df contains the following values:

         Date

0  2023-01-01

1  2023-01-02

2  2023-01-03

3  2023-01-04

4  2023-01-05

Your function should create the following DataFrame:


         Date    Weekday

0  2023-01-01    Sunday

1  2023-01-02     Monday

2  2023-01-03    Tuesday

3  2023-01-04    Wednesday

4  2023-01-05    Thursday

The function should return the modified DataFrame.

In [128]:
# Creating dates from 1 may to 5 may 2023

data = pd.date_range(start = '2023-01-01', end = '2023-01-05')

In [129]:
# creating dataframe out of data variable

df = pd.DataFrame(data = data, columns = ['date'] )
df

        date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [130]:
# creation of day names and dataframe out of it

day_names = data.day_name()
df['Weekday'] = day_names

In [131]:
df

        date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

#### Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [132]:
def date_filter(date):
    return df[df['date'] <= data[-1]]

In [133]:
date_filter(df)

        date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

#### Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

Ans: To use pandas we have to import pandas library and then start our analysis journey.